#include <stdio.h>

// продолжительность урока 45мин. начало в 9:00
// после нечетных уроков перемена 5мин, после четных 15мин
//1 - 45*1 + 0*5 + 0*15, 
//2 - 45*2 + 1*5 + 0*15, 
//3 - 45*3 + 1*5 + 1*15,
//4 - 45*4 + 2*5 + 1*15, 
//5 - 45*5 + 2*5 + 2*15,
//6 - 45*6 + 3*5 + 2*15, 
// вероятно, колво пятиминутных это n / 2
// и из рассмотрения тривиально, что кол-во пятнадцатиминутных (n-1)/2

int main(){
    int n = 0;
    scanf("%d", &n);

    int dif = n*45 + (n/2)*5 + ((n-1)/2)*15;

    int hours = 9 + dif / 60;
    int min = dif % 60;
    
    printf("%d %d", hours, min);

    return 0;
}